package com.generics;

/*
 * vector, arraylist, Set, Map, List, Iterator
 * 
 * 대부분의 언어에서 API로 기본 자료구조를 만들어 저장
 * 
 * 컬렉션 프레임워크
 * Collection
 * 		Set  중복 없는 객체를 모아 사용 (동일 객체 중복 불가)
 * 		List 순서가 있는 객체 (중복 객체 사용 가능)
 * 
 * Map - 사전과 구조가 비슷한 객체를 저장 
 * 			key : value(객체) 을 쌍으로 데이터를 저장 구조
 * 		-> key를 통해 값을 빠르게 찾을 수 있음
 * 			키 중복 불가, 값은 중복 가능, 순서 없음, 빠른 검색 가능
 * 
 * Sorted 순서가 있는 데이터 관리에 용이, 차순이 있음
 * 
 * * 컬렉션 프레임워크의 인터페이스를 사용하려면 실제 구현 클래스의 인스턴스를 생성해야함
 * 
 * 
 * * Set 인터페이스
 *		순서에 관련이 없음
 *		Set 인터페이스 사용 시 중복된 데이터만 저장하지 않으면 됨
 *		push 자료 입력 pop 자료 출력
 *   
 * * List 인터페이스
 * 		
 *   
 * * Map 인터페이스
 *   put, remove
 *   key, 
 *
 * * Iterator 인터페이스 (주로 사용)
 *		컬렉션에 포함된 객체를 순차적으로 접근할 때 사용
 *		모든 컬렉션에는 iterator() 메소드가 있다
 *		포커, 고스톱 게임에서 카드를 나눠줄 때 주로 사용
 * 
 * 
*/

public class Collection {

}
